Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.render_carousel will be created
+ resource "aws_ecs_task_definition" "render_carousel" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "python",
                      + "lambda_function.py",
                    ]
                  + environment      = [
                      + {
                          + name  = "EVENT_JSON"
                          + value = ""
                        },
                      + {
                          + name  = "FFMPEG_PATH"
                          + value = "/opt/bin/ffmpeg"
                        },
                      + {
                          + name  = "TARGET_BUCKET"
                          + value = "prod-sharedservices-artifacts-bucket"
                        },
                      + {
                          + name  = "TASK_TOKEN"
                          + value = ""
                        },
                    ]
                  + image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_carousel@sha256:c95449aaeb0d5a19379f10b838225abba9d27f52e37736a069ae0fcf1164e571"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/render_carousel"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/mnt/efs"
                          + readOnly      = false
                          + sourceVolume  = "efs"
                        },
                    ]
                  + name             = "render_carousel"
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role"
      + family                   = "render_carousel"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + task_role_arn            = "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role"
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "efs"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0e0f22150227b252a"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-076e0e4723ceab689"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role_policy.sfn_runs_ecs will be updated in-place
~ resource "aws_iam_role_policy" "sfn_runs_ecs" {
        id          = "sharedservices_step_functions_role:sfn-run-ecs"
        name        = "sfn-run-ecs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_carousel:1"
                    },
                  - {
                      - Action   = [
                          - "ecs:DescribeTasks",
                          - "ecs:StopTask",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                          - "events:RemoveTargets",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:us-east-2:825765422855:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:InvokeFunction",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                          + "logs:CreateLogDelivery",
                          + "logs:GetLogDelivery",
                          + "logs:UpdateLogDelivery",
                          + "logs:DeleteLogDelivery",
                          + "logs:ListLogDeliveries",
                          + "logs:PutResourcePolicy",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                        ]
                      ~ Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6",
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:33",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "events:RemoveTargets",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6"
                    },
                    {
                        Action    = "iam:PassRole"
                        Condition = {
                            StringEquals = {
                                "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.stepfunctions_run_render_carousel will be updated in-place
~ resource "aws_iam_role_policy" "stepfunctions_run_render_carousel" {
        id          = "sharedservices_step_functions_role:stepfunctions-run-render-carousel"
        name        = "stepfunctions-run-render-carousel"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTasks",
                          - "ecs:DescribeTaskDefinition",
                          - "ecs:StopTask",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/render_carousel:1",
                          - "arn:aws:ecs:us-east-2:825765422855:cluster/sharedservices-render-cluster",
                          - "arn:aws:ecs:us-east-2:825765422855:task/*",
                        ]
                      - Sid      = "EcsRunAndDescribe"
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                      - Sid       = "PassRolesToECSTasks"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.manual_carousel_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "manual_carousel_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "Manual carousel workflow"
              - StartAt = "GetLogo"
              - States  = {
                  - DeleteLogo     = {
                      - End        = true
                      - InputPath  = "$"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:delete_logo"
                      - ResultPath = "$.deleteResult"
                      - Type       = "Task"
                    }
                  - GetLogo        = {
                      - InputPath  = "$"
                      - Next       = "RenderCarousel"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:get_logo"
                      - ResultPath = "$.logoResult"
                      - Type       = "Task"
                    }
                  - NotifyFailure  = {
                      - Next       = "DeleteLogo"
                      - Parameters = {
                          - "accountName.$" = "$.accountName"
                          - "error.$"       = "$.renderError"
                        }
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      - ResultPath = "$.notifyResult"
                      - Type       = "Task"
                    }
                  - NotifySuccess  = {
                      - InputPath  = "$"
                      - Next       = "DeleteLogo"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      - ResultPath = "$.notifyResult"
                      - Type       = "Task"
                    }
                  - RenderCarousel = {
                      - Catch          = [
                          - {
                              - ErrorEquals = [
                                  - "States.ALL",
                                ]
                              - Next        = "NotifyFailure"
                              - ResultPath  = "$.renderError"
                            },
                        ]
                      - Next           = "NotifySuccess"
                      - Parameters     = {
                          - Cluster              = "arn:aws:ecs:us-east-2:825765422855:cluster/sharedservices-render-cluster"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - AssignPublicIp = "ENABLED"
                                  - SecurityGroups = [
                                      - "sg-00b24671fa06607c7",
                                    ]
                                  - Subnets        = [
                                      - "subnet-0bbe8a2b2335e4038",
                                      - "subnet-0b4e467b5cedc1cd3",
                                    ]
                                }
                            }
                          - Overrides            = {
                              - ContainerOverrides = [
                                  - {
                                      - Environment = [
                                          - {
                                              - Name      = "TASK_TOKEN"
                                              - "Value.$" = "$$.Task.Token"
                                            },
                                          - {
                                              - Name      = "EVENT_JSON"
                                              - "Value.$" = "States.JsonToString($)"
                                            },
                                        ]
                                      - Name        = "render_carousel"
                                    },
                                ]
                            }
                          - TaskDefinition       = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_carousel:1"
                        }
                      - Resource       = "arn:aws:states:::ecs:runTask.waitForTaskToken"
                      - TimeoutSeconds = 7200
                      - Type           = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_carousel_workflow"
        name                      = "manual_carousel_workflow"
        tags                      = {
            "Project" = "sharedservices"
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 6 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```